{
  "home": {
    "construction_warning": "Ce site web est encore en construction",
    "description": {
      "intro": {
        "title": "Bonjour !",
        "content": {
          "1": "Je suis un développeur de ",
          "2": " ans habitant actuellement en France."
        }
      },
      "journey": {
        "title": "Mon parcours en programmation",
        "content": {
          "1": "Mon parcours en programmation a commencé il y a ",
          "2": " ans, motivé par la curiosité et un amour pour la résolution de problèmes. J'ai commencé avec Python, ce qui m'a aidé à comprendre les concepts de programmation et à explorer des domaines comme le scripting, l'automatisation et le développement de logiciels de base.",
          "3": "En cherchant à relever des défis plus techniques, je me suis tourné vers Rust que j'apprécie tout particulièrement pour ses performances, sa sécurité et son système de types robuste."
        }
      },
      "frontend": {
        "title": "Expansion dans le développement Front-End",
        "content": {
          "1": "Bien que le développement logiciel / backend soit ma principale préoccupation, j'apprécie également de travailler sur des projets front-end pour créer des expériences utilisateur engageantes. Je travaille avec Yew, un framework en Rust qui utilise WebAssembly pour des applications web performantes.",
          "2": "Bien que j'aie de l'expérience avec des frameworks JavaScript populaires comme React et Next.js, je trouve Yew particulièrement excitant car il combine mon amour pour Rust avec les pratiques modernes de développement web."
        }
      },
      "open_source": {
        "title": "Contributions Open Source",
        "content": {
          "1": "Un des aspects les plus gratifiants de ma carrière a été de contribuer à des projets open-source. Je suis fier d'être un contributeur du framework de jeu 2D ggez, qui permet aux développeurs de créer des jeux 2D simples mais puissants en utilisant Rust.",
          "2": "En tant que contributeur, je m'occupe de tâches telles que l'amélioration de la fonctionnalité du framework, l'assistance à d'autres développeurs en examinant les pull requests, et en veillant à la compatibilité avec les nouvelles versions de Rust et les bibliothèques associées. Cette expérience m'a appris des leçons précieuses sur la collaboration et la construction de communauté."
        }
      },
      "experience": {
        "title": "Expérience",
        "content": "J'ai complété un stage de 3 mois chez 'Artistes Sans Frontières', où j'ai développé un serveur de stockage pour gérer et stocker efficacement des images, optimisant l'utilisation de l'espace disque."
      },
      "personal_statement": {
        "title": "Déclaration personnelle",
        "content": "Je suis passionné par le codage et dédié à la création de solutions logicielles impactantes. Je cherche continuellement à apprendre de nouvelles technologies et à améliorer mes compétences."
      },
      "connect": {
        "title": "Connectons-nous",
        "content": {
          "1": "Veuillez vous rendre sur la ",
          "2": " pour me contacter."
        },
        "button_text": "page de contact"
      }
    },
    "skills": {
      "title": "Compétences techniques"
    }
  },
  "gitrepos": {
    "title": "Voici mes dépôts git classés par date de mise à jour la plus récente"
  }
}